


&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТД = Элементы.Товары.ТекущиеДанные;
	ТД.ТекущаяЦена = ПолучитьЦенуНаСервере(ТД.Номенклатура);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуНаСервере(Номенклатура)
	
	Возврат ОбщегоНазначения.ПолучитьЦенуНоменклатурыНаДату(Номенклатура, Объект.Дата);
	
КонецФункции // ПолучитьЦенуНаСервере()


&НаКлиенте
Процедура Добавить(Команда)
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		СтрокаТЧ.НоваяЦена = СтрокаТЧ.ТекущаяЦена + ПараметрРасчета;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Умножить(Команда)
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		СтрокаТЧ.НоваяЦена = СтрокаТЧ.ТекущаяЦена * ПараметрРасчета;
	КонецЦикла;
КонецПроцедуры
