
&НаКлиенте
Процедура КалькуляторПлощади(Команда)
	ОткрытьФорму("Обработка.КалькуляторПлощадиКожиВДм.Форма.Форма",,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник.ИмяФормы = "Обработка.КалькуляторПлощадиКожиВДм.Форма.Форма" И
		ИмяСобытия = "РезультатПосчитан" Тогда
		ТекущиеДанные = Элементы.НоменклатураДляПеремещения.ТекущиеДанные;
		ТекущиеДанные.Количество = Параметр;
	КонецЕсли;
	
КонецПроцедуры
