
&НаСервереБезКонтекста
Функция ПолучитьСебестоимостьНаСервере(Товар)
	Возврат ОбщегоНазначения.ПолучитьСебестоимостьТовара(Товар);
КонецФункции

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТД = Элементы.Товары.ТекущиеДанные;
	ТД.Стоимость = ПолучитьСебестоимостьНаСервере(ТД.Номенклатура);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТД = Элементы.Товары.ТекущиеДанные;
	ТД.Себестоимость = ТД.Количество * ТД.Стоимость;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТД = Элементы.Товары.ТекущиеДанные;
	ТД.Себестоимость = ТД.Количество * ТД.Стоимость;
КонецПроцедуры
