#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	мскОбщегоНазначенияКлиент.РасчитатьСуммуСтрокиТЧ(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	мскОбщегоНазначенияКлиент.РасчитатьСуммуСтрокиТЧ(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	мскОбщегоНазначенияКлиент.РасчитатьЦенуСтрокиТЧ(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.ЕдиницаИзмерения = ТоварыНоменклатураПриИзмененииНаСервере(ТекущиеДанные.Номенклатура);
КонецПроцедуры

&НаСервере
Функция ТоварыНоменклатураПриИзмененииНаСервере(Номенклатура)
	
	Возврат мскОбщегоНазначения.ПолучитьЕдиницуИзмеренияНоменклатуры(Номенклатура);

КонецФункции // ТоварыНоменклатураПриИзмененииНаСервере()







#КонецОбласти