
Процедура ОбработкаПроведения(Отказ, Режим)
	
	УстановкаЦенИзДокументовПоступления = Константы.УстановкаЦенИзДокументовПоступления.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриобретениеТоваровИУслугТовары.Номенклатура КАК Номенклатура,
		|	СУММА(ПриобретениеТоваровИУслугТовары.Количество) КАК Количество,
		|	СУММА(ПриобретениеТоваровИУслугТовары.Цена) КАК Цена,
		|	СУММА(ПриобретениеТоваровИУслугТовары.Сумма) КАК Стоимость
		|ИЗ
		|	Документ.ПриобретениеТоваровИУслуг.Товары КАК ПриобретениеТоваровИУслугТовары
		|ГДЕ
		|	ПриобретениеТоваровИУслугТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПриобретениеТоваровИУслугТовары.Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СуммаУслугКРаспределению = Услуги.Итог("Сумма") / Выборка.Количество();
	
	//Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.Себестоимость.Записывать = Истина;
	Движения.ОстаткиДенег.Записывать = Истина;
	
	Если УстановкаЦенИзДокументовПоступления Тогда
		
		Движения.ЦеныПоставщиков.Записывать = Истина;
		
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		Цена = Выборка.Стоимость + СуммаУслугКРаспределению;
		ЦенаЗаЕдиницу = Цена / Выборка.Количество;
		
		// регистр ОстаткиТоваров Приход
		//Движение = Движения.ОстаткиТоваров.ДобавитьПриход();
		//Движение.Период = Дата;
		//Движение.Номенклатура = Выборка.Номенклатура;
		//Движение.Количество = Выборка.Количество;
		
		// регистр Себестоимость
		Движение = Движения.Себестоимость.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.ЦенаЗаЕдиницу = ЦенаЗаЕдиницу;
		
		
		Если УстановкаЦенИзДокументовПоступления Тогда
			
			Движение = Движения.ЦеныПоставщиков.Добавить();
			Движение.Период = Дата;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Поставщик = Контрагент;
			Движение.Цена = Выборка.Цена;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Движение = Движения.ОстаткиДенег.ДобавитьРасход();
	Движение.Период = Дата;
	Движение.Касса = Касса;
	Движение.Сумма = СуммаДокумента;
	Движение.СтатьяДоходовИРасходов = Статья;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Товары.Количество() = 0 Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполните список товаров";
		Сообщение.Сообщить();
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	СуммаУслуг = Услуги.Итог("Сумма");
	
КонецПроцедуры


