
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПередЗаписьюНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере()

	СписокТоваров = Объект.Товары.Выгрузить(,"Номенклатура");
	ТЗСебестоимость = ОбщегоНазначения.ПолучитьСебестоимостьТоваров(СписокТоваров, Объект.Дата);
	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		СтрокаТЗ = ТЗСебестоимость.Найти(СтрокаТЧ.Номенклатура, "Номенклатура");
		СтрокаТЧ.Себестоимость = СтрокаТЗ.ЦенаЗаЕдиницу * СтрокаТЧ.Количество;
	КонецЦикла;
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Себестоимость");

КонецПроцедуры // ПередЗаписьюНаСервере()
